Tekla Open API Reference for Tekla Structures 2025
BasePoint Constructor (Int32, Guid, String, String, String, String, Double, Double, Double, Double, Double, Double, Double, Double, Double, Boolean, Boolean)
 Initializes a new instance of the BasePoint class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BasePoint(
	int id,
	Guid guid,
	string initialGuid,
	string name,
	string description,
	string coordinateSystem,
	double northSouth,
	double eastWest,
	double elevation,
	double latitude,
	double longitude,
	double locationInModelX,
	double locationInModelY,
	double locationInModelZ,
	double angleToNorth,
	bool isProjectBasePoint,
	bool isCurrentBasePoint
)
Public Sub New (
	id As Integer,
	guid As Guid,
	initialGuid As String,
	name As String,
	description As String,
	coordinateSystem As String,
	northSouth As Double,
	eastWest As Double,
	elevation As Double,
	latitude As Double,
	longitude As Double,
	locationInModelX As Double,
	locationInModelY As Double,
	locationInModelZ As Double,
	angleToNorth As Double,
	isProjectBasePoint As Boolean,
	isCurrentBasePoint As Boolean
)
Parameters
id
Type: System.Int32
The id.
guid
Type: System.Guid
The guid.
initialGuid
Type: System.String
The initial guid.
name
Type: System.String
The name.
description
Type: System.String
The description.
coordinateSystem
Type: System.String
The coordinate system.
northSouth
Type: System.Double
The north-south.
eastWest
Type: System.Double
The east-west.
elevation
Type: System.Double
The elevation.
latitude
Type: System.Double
The latitude.
longitude
Type: System.Double
The longitude.
locationInModelX
Type: System.Double
The location in model x.
locationInModelY
Type: System.Double
The location in model y.
locationInModelZ
Type: System.Double
The location in model z.
angleToNorth
Type: System.Double
The angle to north in radians.
isProjectBasePoint
Type: System.Boolean
Boolean indicating if this base point is the project base point.
isCurrentBasePoint
Type: System.Boolean
Boolean indicating if this base point is the current base point.
See Also
Reference
BasePoint Class
BasePoint Overload
Tekla.Structures.Model Namespace